#####################################################
# Taps (Third-party Repositories)                   #
#####################################################
# Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
# Yabai/SKHD
tap "koekeishiya/formulae"
# Spacebar
tap "cmacrae/formulae"

#####################################################
# Brews (Packages)                                  #
#####################################################
# Tools/Utilities
brew "git"
brew "fish"
brew "neofetch"
brew "defaultbrowser"
brew "wallpaper"
# Development
brew "openjdk"
# Apperance
brew "bat"
brew "exa"
# Window Manager
brew "yabai"
brew "skhd"
brew "spacebar"

#####################################################
# Casks (Applications)                              #
#####################################################
# Tools/Utilities
cask "kitty", args: { no_quarantine: true }
cask "firefox", args: { no_quarantine: true }
cask "google-chrome", args: { no_quarantine: true }
cask "notion", args: { no_quarantine: true }
# Gaming
cask "runelite", args: { no_quarantine: true }
cask "minecraft", args: { no_quarantine: true }
cask "steam", args: { no_quarantine: true }
# Work
cask "microsoft-teams", args: { no_quarantine: true }
cask "cisco-jabber", args: { no_quarantine: true }
cask "tableau", args: { no_quarantine: true }
cask "tableau-prep", args: { no_quarantine: true }
# Productivity
cask "zoom", args: { no_quarantine: true }
# Content Creation
cask "adobe-creative-cloud", args: { no_quarantine: true }
# Virtualization
cask "parallels", args: { no_quarantine: true } 
# Development
cask "eclipse-java", args: { no_quarantine: true }

#####################################################
# Mac App Store                                     #
#####################################################
# Tools/Utilities
mas "bitwarden", id: 1352778147
# Productivity
mas "iA Writer", id: 775737590

#####################################################
# System Fonts                                      #
#####################################################
# Used in: .spaceebarrc & kitty.conf
cask "font-meslo-lg-nerd-font"
